app/controllers/admin/supplier_controller.rb

INSERT INTO `suppliers` (`created_at`, `name`, `updated_at`) VALUES ('2016-03-29 15:11:04', 'Loreal', '2016-03-29 15:11:04')
---
  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save

SELECT  `suppliers`.* FROM `suppliers`  WHERE `suppliers`.`id` = 2 LIMIT 1
---
  def edit
    @supplier = Supplier.find(params[:id])

SELECT  `suppliers`.* FROM `suppliers`  WHERE `suppliers`.`id` = 2 LIMIT 1
---
  def update
    @supplier = Supplier.find(params[:id])

SELECT  `suppliers`.* FROM `suppliers`  WHERE `suppliers`.`id` = 2 LIMIT 1
---
  def show
    @supplier = Supplier.find(params[:id])

SELECT `suppliers`.* FROM `suppliers`
---
  def index
    @suppliers = Supplier.all